---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternTable.Dispose
source: html/f346e6ab-abef-f680-fe84-db23b9452057.htm
---
# Autodesk.Revit.DB.ExportPatternTable.Dispose Method

Releases all resources used by the ExportPatternTable

## Syntax (C#)
```csharp
public void Dispose()
```